package main

import (
	"fmt"
)

func main() {
	v01, v03, v02 := 40.0, 400000000.0, 12.32
	// 二进制指数的科学记数法(%b)：5629499534213120p-47
	fmt.Printf("二进制指数的科学记数法（%%b）%b\n", v01)
	// 科学计数法（%e）：4.000000e+01
	fmt.Printf("科学计数法（%%e）：%e\n", v01)
	// 科学计数法（%E)：4.000000E+01
	fmt.Printf("科学计数法（%%E)：%E\n", v01)
	// 浮点数，但是没有小数部分（%f)：40.000000
	fmt.Printf("浮点数，但是没有小数部分（%%f)：%f\n", v01)
	// 等价于%f（%F)：40.000000
	fmt.Printf("等价于%%f（%%F)：%F\n", v01)
	// 根据情况使用%e或%f（%g）：4e+08, 12.32
	fmt.Printf("根据情况使用%%e或%%f（%%g）：%g, %g\n", v03, v02)
	// 根据情况使用%E或%F（%G）：4E+08, 12.32
	fmt.Printf("根据情况使用%%E或%%F（%%G）：%G, %G\n", v03, v02)
	// 十六进制表示法（具有两个指数的十进制幂）（%x）：0x1.7d784p+28, 0x1.8a3d70a3d70a4p+03
	fmt.Printf("十六进制表示法（具有两个指数的十进制幂）（%%x）：%x, %x\n", v03, v02)
	// 大写十六进制表示法（%X）：0X1.7D784P+28, 0X1.8A3D70A3D70A4P+03
	fmt.Printf("大写十六进制表示法（%%X）：%X, %X\n", v03, v02)

}
